content/posts/20200615145456-text_summarization.md
+++
title = "Text Summarization"
author = ["Alex Day"]
lastmod = 2020-12-13T20:15:22-05:00
draft = false
+++

## Introduction {#introduction}

Text summarization can be broadly split into two categories:


### Abstractive {#abstractive}

Produce sentences that represent the document without using sentences from the document. Generate new words and phrases to summarize


### Extractive {#extractive}

Extract sentences already present within the document and present the ones that are most representative of the document
